[
    {
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/qFM9TT1/the-grate-gatsbay.jpg",
        "review": "A timeless classic that delves into the complexities of the American Dream and its dark underbelly. Fitzgerald's prose is exquisite, painting a vivid picture of the roaring twenties and the enthralling yet ultimately tragic story of Jay Gatsby. Through the enigmatic Gatsby, readers are immersed in a world of love, wealth, and societal aspirations, while confronting themes of identity, obsession, and the elusive pursuit of happiness. The Great Gatsby remains a masterpiece of American literature, its themes and characters continuing to resonate with readers, making it an essential addition to any bookshelf.",
        "totalPages": 180,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classic", "Romance", "American Literature"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/ZNRVnsV/to-kill-a-mocking-bird.jpg",
        "review": "A powerful portrayal of racial injustice and moral growth in the American South. Harper Lee's narrative grips the reader from the first page, as seen through the eyes of Scout Finch. Through the trial of Tom Robinson, Lee confronts themes of prejudice, empathy, and integrity, making this novel a timeless masterpiece. To Kill a Mockingbird is not just a story; it's a mirror reflecting the realities of society, challenging readers to confront injustice and find the courage to stand up for what is right.",
        "totalPages": 324,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Classic", "Social Issues", "Coming of Age"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/JrtWbnC/1994.jpg",
        "review": "A dystopian novel that remains eerily relevant in its depiction of surveillance and authoritarianism. Orwell's prophetic vision of a totalitarian regime controls every aspect of life, resonating with contemporary concerns. The chilling exploration of power, truth, and individuality leaves readers questioning the fragility of freedom in society. 1984 serves as a stark warning against the dangers of unchecked authority, urging readers to remain vigilant and to safeguard the principles of democracy and human rights.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Dystopian", "Political", "Philosophical"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/MNh6Dgc/pride-and-prejudice.jpg",
        "review": "A delightful romance set in early 19th-century England, exploring themes of love, class, and manners. Austen's wit and satire are at their finest in this tale of Elizabeth Bennet and Mr. Darcy. Through misunderstandings and societal norms, Austen crafts a timeless love story that continues to captivate readers worldwide. Pride and Prejudice not only entertains but also offers insightful commentary on the social conventions of its time, reminding us that while society may change, the intricacies of human relationships remain constant.",
        "totalPages": 432,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Classic", "Romance", "Regency Era"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/XLJpg11/the-catcher-in-the-rye.jpg",
        "review": "An iconic coming-of-age novel that captures the angst and alienation of adolescence. Salinger's protagonist, Holden Caulfield, resonates with readers as he navigates the complexities of identity and societal expectations. Through Holden's candid voice, Salinger explores themes of innocence, loss, and the search for authenticity in a conformist world. The Catcher in the Rye continues to be a touchstone for readers of all ages, reminding us of the tumultuous journey of youth and the universal quest for meaning and connection.",
        "totalPages": 224,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Coming of Age", "Literature", "Bildungsroman"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/fr0L9M3/the-hobbit.jpg",
        "review": "A charming fantasy adventure that follows the journey of Bilbo Baggins. Tolkien's rich imagination brings Middle-earth to life, enchanting readers with its diverse landscapes and vibrant characters. Through Bilbo's quest to reclaim the treasure guarded by Smaug the dragon, Tolkien weaves themes of courage, friendship, and the allure of adventure. The Hobbit is more than a tale of heroism; it's a testament to the power of ordinary individuals to make extraordinary differences in the face of adversity.",
        "totalPages": 310,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Adventure", "Middle-earth", "Quest"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Harry Potter",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/5Mwh01P/harry-potter-and-the-philosophers-stone.jpg",
        "review": "The magical beginning of the beloved Harry Potter series. Rowling's world-building prowess shines as she introduces readers to Hogwarts School of Witchcraft and Wizardry. Through Harry's journey from the mundane to the magical, Rowling instills themes of friendship, bravery, and the triumph of good over evil, captivating readers of all ages. Harry Potter and the Philosopher's Stone is more than just a fantasy novel; it's an invitation to a world of wonder, where imagination knows no bounds and the power of love conquers all.",
        "totalPages": 320,
        "rating": 4.9,
        "category": "Fantasy",
        "tags": ["Magic", "Wizards", "Children's Literature"],
        "publisher": "Bloomsbury",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 8,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/SyC6PLC/the-hunger-games.jpg",
        "review": "A gripping dystopian tale set in a future where teenagers fight to the death for televised entertainment. Collins' narrative is relentless, exploring themes of survival, sacrifice, and rebellion against oppression. Through Katniss Everdeen's journey, Collins provokes thought on the consequences of power and the resilience of the human spirit. The Hunger Games is more than just a thrilling adventure; it's a reflection of our society's obsession with spectacle and the lengths individuals will go to for freedom and justice.",
        "totalPages": 374,
        "rating": 4.5,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Adventure", "Young Adult"],
        "publisher": "Scholastic Press",
        "yearOfPublishing": 2008
    },
    {
        "bookId": 9,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/jZQ86ZJ/gone-girl.jpg",
        "review": "A thrilling psychological suspense novel that keeps readers guessing until the very end. Flynn's narrative is a rollercoaster of twists and turns, blurring the lines between truth and deception. Through the perspectives of Nick and Amy Dunne, Flynn explores themes of marriage, identity, and societal expectations, leaving readers questioning the nature of truth and the darkness that lies within us all. Gone Girl is a gripping page-turner that challenges perceptions and keeps readers on the edge of their seats until the final, shocking revelation.",
        "totalPages": 432,
        "rating": 4.3,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological", "Thriller"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 10,
        "bookName": "The Girl on the Train",
        "author": "Paula Hawkins",
        "image": "https://i.ibb.co/hRM9Tgx/the-girl-on-the-train.jpg",
        "review": "A gripping psychological thriller with an unreliable narrator and plenty of twists. Hawkins' narrative delves into the complexities of memory, perception, and obsession, keeping readers guessing until the very end. Through the perspectives of Rachel, Anna, and Megan, Hawkins weaves a web of lies and deceit, revealing the dark truths hidden beneath the surface of seemingly ordinary lives. The Girl on the Train is a riveting exploration of human nature and the consequences of our actions, leaving readers questioning who to trust and what to believe.",
        "totalPages": 336,
        "rating": 4.2,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological", "Domestic Noir"],
        "publisher": "Riverhead Books",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 11,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.ibb.co/9wF8nsg/the-da-vinci-code.jpg",
        "review": "An exhilarating adventure that combines art, religion, and conspiracy. Brown's narrative follows symbologist Robert Langdon as he unravels clues hidden in famous artworks and historical landmarks, leading to a shocking discovery that could change the course of history. Through twists and turns, Brown explores themes of faith, knowledge, and the eternal quest for truth. The Da Vinci Code is more than just a thriller; it's a thought-provoking journey that challenges assumptions and leaves readers questioning the boundaries between fact and fiction.",
        "totalPages": 454,
        "rating": 4.1,
        "category": "Mystery",
        "tags": ["Thriller", "Conspiracy", "Art"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 12,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/wS1VyWV/the-alchemist.jpg",
        "review": "A philosophical novel about following one's dreams and finding one's destiny. Coelho's narrative follows Santiago, a shepherd boy, as he embarks on a journey in search of treasure and self-discovery. Through encounters with various characters and challenges, Santiago learns valuable lessons about the importance of listening to one's heart and pursuing one's dreams, no matter the obstacles. The Alchemist is more than just a story; it's a timeless parable that inspires readers to reflect on their own paths in life and the pursuit of fulfillment and purpose.",
        "totalPages": 208,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure", "Quest"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    }
    
]